[
  "{\n  \"url\": \"https://www.reuters.com/business/finance/wall-st-week-ahead-us-housing-shares-shine-fed-restarts-rate-cuts-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/DQB5ISARN5JMTHE4COZYQLRHOI.jpg?auth=845f25831342aba44beccd1b78b5a878f734c7e8d03745f994ee286e88ac0e07&width=1080&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Wall St Week Ahead: US housing shares shine as Fed restarts rate cuts\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"NEW YORK, Sept 19 (Reuters) - As the U.S. Federal Reserve restarts interest rate cuts, housing shares are one of the areas of the stock market that may benefit, and they have perked up in recent weeks as markets priced in more monetary easing. On Wednesday, the U.S. central bank lowered its benchmark rate for the first time since December and indicated more cuts would follow as it tries to shore up a shaky labor market. The Fed's move stands to help interest-rate sensitive areas such as small-cap and consumer discretionary shares. Homebuilder stocks could also benefit if monetary easing translates into lower mortgage rates and more robust economic activity that helps the struggling housing sector, investors said. \\\"The Fed is rebooting the easing cycle,\\\" said Angelo Kourkafas, senior global investment strategist at Edward Jones. \\\"If we think about areas that may stand to benefit from that... homebuilders is one of them.\\\" The S&P 500 ended on Friday at record high levels, up over 13% on the year, after the Fed cut its benchmark rate by a quarter of a percentage point to the 4-4.25% range. On Thursday, the small-cap Russell 2000 posted a record-high close for the first time in nearly four years. Some investors hope the restart of monetary easing will boost economically sensitive stocks, broadening market leadership beyond the megacap technology companies that have driven indexes higher. The PHLX Housing index has jumped 15% so far this quarter, against an over 7% gain for the S&P 500, although the housing gauge still trails the benchmark stock market index on a year-to-date basis. Big gainers this quarter include DR Horton, up over 30%, and KB Home and Toll Brothers, both up over 20%. Home improvement retailers Lowe's and Home Depot are up about 20% and 13% so far in the quarter. The Mortgage Bankers Association said this week that the contract rate on a 30-year, fixed-rate mortgage fell to 6.39% in the week ended September 12, the lowest since early October 2024, while analysts at Keefe, Bruyette & Woods projected that the mortgage rates could approach 6% by year-end. The Fed's move to lower interest rates comes amid signs of struggle in the housing market. U.S. single-family homebuilding plunged to a near 2-1/2-year low in August, data on Wednesday showed. Fed Chair Jerome Powell described housing sector activity as \\\"weak\\\" in a press conference after the central bank's policy decision. \\\"If you can get some of those mortgage rates to come down, maybe that breathes a little bit of life back into the housing market,\\\" said Jack Janasiewicz, lead portfolio strategist at Natixis Investment Managers Solutions, adding that getting mortgage rates down in the 5% range was an important threshold. Investors cautioned that a lower Fed funds rate may not reduce mortgage rates by the same extent, because mortgage rates are more tied to the 10-year U.S. Treasury yield, which is influenced by broader factors. The 10-year Treasury yield was last around 4.13%, down from 4.6% in May. The extent of Fed rate reductions this year remains unclear, as persistently firm inflation could prompt the central bank to keep rates higher. Data in the coming week will shed more light on the housing market, including on existing and new home sales. \\\"A good housing turnover is generally good for economic activity,\\\" said Paul Nolte, senior wealth adviser and market strategist at Murphy & Sylvest Wealth Management. \\\"So we'd like to see those numbers rising consistently.\\\" Economic data next week includes an updated read of second-quarter gross domestic product, manufacturing and services sector reports, and the personal consumption expenditures price index, a closely watched inflation gauge, while investors will also be watching remarks from Powell on Tuesday. With the central bank noting it is not on a preset path and a disparity among Fed members about the expected trajectory of rates, \\\"this likely means there will be volatility around forthcoming economic data — especially data on the labor market and inflation,\\\" Seth Basham, director of equity research at Wedbush, said in a note.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/world/americas/argentinas-central-bank-makes-biggest-daily-dollar-sale-six-years-curb-peso-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/DQB5ISARN5JMTHE4COZYQLRHOI.jpg?auth=845f25831342aba44beccd1b78b5a878f734c7e8d03745f994ee286e88ac0e07&width=120&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Argentina's central bank makes biggest daily dollar sale in six years to curb peso slide\",\n  \"main_text\": \"BUENOS AIRES, Sept 19 (Reuters) - Argentina's central bank on Friday made its largest daily dollar sale in nearly six years as it continued to use reserves to support the local currency, meeting strong dollar demand from institutional investors wary of political instability. The bank's latest intervention totaled $678 million, its largest for a single day since October 2019, bringing the amount sold in the last three sessions to $1.1 billion. The bank has been seeking to manage liquidity at the top of its floating exchange-rate band, and Argentina's economy chief vowed to keep using the monetary authority's reserves as the local peso hovers at historic lows. \\\"We're going to sell every last dollar (of the central bank's reserves) at the top of the band,\\\" Economy Minister Luis Caputo said on Thursday night during a livestreamed interview. The deteriorating market backdrop underscores deepening investor skepticism ahead of pivotal midterm elections in October that could strip libertarian President Javier Milei of crucial congressional support for his reform agenda. On Friday, the wholesale peso settled stable at 1,475 per dollar after the central bank's moves, near the band's ceiling. In the informal \\\"blue\\\" market, however, the Argentine currency slipped to an all-time low of 1,520 per greenback, weakening more than 6% in the week. The central bank had not made an intervention since mid-April, after a $20 billion International Monetary Fund deal that initially loosened foreign-exchange curbs. \\\"Given that this pace of dollar sales by the central bank would imply a loss of reserves of approximately $10 billion before the elections - approximately 70% of the funds already disbursed by the IMF - the likelihood of abandoning the exchange-rate band scheme before the October 26 elections increases,\\\" BancTrust & Co said. While the central bank's international reserves stand at $39.26 billion, analysts say provisional official data indicates that net foreign exchange reserves for intervention are estimated at just $6 billion. Continued dollar sales, experts warn, risk accelerating reserve depletion, jeopardizing near-term debt payments and triggering a rise in bond issuance to bridge funding gaps. Caputo affirmed the current exchange rate framework and said the Treasury is working to ensure January debt payments, promising to provide clarity to bondholders once finalized. Argentina's country risk - a measure of investor confidence - reached its highest level since August 2024, hovering around 1,500 basis points, while over-the-counter bonds fell 1.4% on average. They were down 9.2% in the week. Buenos Aires' main stock index closed down 0.7% on Friday. Argentines vote in October to renew part of the lower house and Senate, amid uncertainty over how the government will recover from setbacks in Buenos Aires province in recent contests.\",\n  \"date\": \"September 19, 2025\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/business/tax-firm-andersen-reveals-over-12-revenue-surge-us-ipo-filing-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/TZOKCGN7YBOZHK3U723IBBT674.jpg?auth=16a7acfca91709cf948469925462ca2f4abc22fbe2f21782b2ca80f70a32d825&width=120&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Tax firm Andersen reveals over 12% revenue jump in US IPO filing\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"Sept 19 (Reuters) - Andersen Group reported a 12.4% rise in revenue for the first half of 2025, the professional services firm disclosed on Friday in its U.S. initial public offering filing, setting the stage for a rare listing by a consulting firm. New listings have gained traction as buoyant equity markets and robust corporate earnings help investors navigate a persistently uncertain macroeconomic environment. Crypto custody startup BitGo and corporate travel and expense management firm Navan also filed IPO paperwork on Friday, seeking to go public in New York. Andersen, which confidentially filed for a New York IPO in April, traces its origins to Wealth & Tax Advisory Services, founded in 2002 by 23 former Arthur Andersen partners. Arthur Andersen, once a member of the Big Five accounting firms, collapsed in the aftermath of the Enron scandal, leaving Deloitte, PwC, EY and KPMG as the surviving Big Four. A potential listing by the company would mark a notable emergence from the legacy of Arthur Andersen, positioning it as one of the few publicly traded tax and consulting firms in the United States. \\\"The profile of U.S. IPOs has broadened significantly over the past weeks with strong investor demand for respective deals across sectors,\\\" said Kat Liu, vice president at IPO research firm IPOX. The San Francisco-based company, which rebranded as Andersen in 2014 after acquiring the rights to the name, offers tax, valuation, financial advisory, and related consulting services to individual and commercial clients. The company swung to a loss of $45.4 million on revenue of $384.1 million for the six months ended June 30, compared to a profit of $46.9 million on revenue of $341.6 million in the same period a year earlier. Morgan Stanley and UBS are serving as lead underwriters for the offering. Andersen plans to list on the New York Stock Exchange under the ticker symbol \\\"ANDG\\\".\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/business/take-five/global-markets-themes-graphic-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/ZTAPRYUTDBJJ5A7TUPMARZGSRM.jpg?auth=b5238b9c4a91e0b2b9ffdebbad613a8bc3ec33e6236bd6f94e33b5be96f5d44f&width=120&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Take Five: Chop, chop!\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"LONDON, Sept 19 (Reuters) - It's back to scouring data for signs of how quickly, if at all, further rate cuts could come from big economies, Switzerland's central bank meets and world leaders gather in New York for the UN general assembly against a tense geopolitical backdrop. Here's all you need to know about the week ahead in global markets from Lewis Krauskopf in New York, Rae Wee in Singapore and Amanda Cooper, Sara Rossi and Karin Strohecker in London. The U.S. Federal Reserve has just cut rates for the first time since December and indicated more is to come. That's the backdrop to the slew of U.S. data out in coming days including housing, durable goods, consumer sentiment and inflation. Monthly reports on new and existing home sales are due as investors weigh whether the prospect of a series of rate cuts can lift the housing market. An updated look at Q2 gross domestic product will paint more of a picture about growth, before the week closes on Friday with a consumer sentiment survey and the personal consumption expenditures price index, a closely watched inflation gauge. As focus shifts to the economic outlook over inflation, any weaker-than-expected numbers could further hurt the dollar - it touched its lowest level since 2022 on Wednesday. The Swiss National Bank meets on Thursday and traders expect no change to the benchmark rate, currently at 0%. SNB officials have indicated the bar is high for a drop into negative territory, even in light of the headache caused by a strong Swiss franc. It has rallied by around 15% against the dollar year-to-date and is set for its largest annual gain since 2002. In Europe, Tuesday's preliminary estimates for the September euro zone PMI could show further improvement in the manufacturing sector and a stabilisation in expansionary territory for services. Britain's flash PMI, also out Tuesday, follows the latest BoE decision to leave rates steady. Australia's August consumer price reading on Wednesday comes ahead of the September 30 Reserve Bank of Australia policy meeting, where officials are widely expected to stand pat on rates. Investors and policymakers will be hoping that latest inflation figures show some signs of easing. World leaders are meeting in New York for the United Nations General Assembly at a fraught time for global politics. Trump will speak on Tuesday, while Israeli Prime Minister Benjamin Netanyahu is due to address the assembly on Friday.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/business/us-equity-funds-see-large-outflows-investors-book-profit-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/FUBTGATC45MSXCEDX2I2CX4ZVQ.jpg?auth=cba10a311c21f91601923c24eeddcddfa84783f286a866aec0afce19d913818a&width=3539&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"U.S. equity funds see large outflows as investors book profit\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"Sept 19 (Reuters) - Investors withdrew massive capital out of U.S. equity funds in the week to Sept. 17 as they turned cautious about the market's lofty valuations following the recent rally through a policy rate cut by the Federal Reserve and rushed to lock in profits. According to LSEG Lipper data, investors pulled out a net $43.19 billion from U.S. equity funds in the week, logging their largest weekly net sales since a $50.62 billion weekly outflow in mid-December 2024. The S&P 500 hit a record high of 6,656.8 on Thursday, close to a 37.7% gain from nearly a 1-1/2 year low of 4,835.04 hit of April 7. \\\"The S&P 500 forward price-to-earnings ratio, at 22.6x, is in the 99th percentile over the past 20 years,\\\" said Mark Haefele, Chief Investment Officer at UBS Global Wealth Management. \\\"After such a strong recent run, a period of consolidation should not come as a surprise, in our view,\\\" UBS's Haefele said. U.S. large-cap funds had a net $34.19 billion weekly outflow, the biggest since at least 2020. Investors also shed mid-cap funds of $1.58 billion but invested a marginal $50 million in small-cap funds. Sectoral funds saw a net $1.24 billion outflow, the first weekly net sales in four weeks as investors dumped technology sector funds of a robust $2.84 billion. U.S. bond funds, meanwhile, saw a 22nd successive weekly inflow to the tune of $7.33 billion. The short-to-intermediate investment-grade funds, general domestic taxable fixed income funds and municipal debt funds stood out with $1.59 billion, $1.14 billion and $1.04 billion, respectively in weekly inflows. Investors, meanwhile, ditched $23.65 billion worth of money market funds, bringing a three-week trend of net purchases to an end. Reporting by Gaurav Dogra; Editing by Nick Zieminski.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/world/americas/canada-will-take-close-look-teck-anglo-deal-finance-minister-says-2025-09-20/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/DWNXCMIMT5KOPO7Q4RXJV6UWGQ.jpg?auth=0b9c06335f047599b572b4b0531a2eef20b6bfb9924e10f022f35c52c72baa21&width=1080&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Canada will take a close look at the Teck-Anglo deal, finance minister says\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"TORONTO, Sept 20 (Reuters) - The proposed $53 billion merger between Teck Resources and Anglo American is under review by Canada's federal government, which must make sure it is in the net benefit of the country, Finance Minister Francois Philippe Champagne said on Saturday. \\\"Canada will take a close look at the Teck-Anglo deal,\\\" Champagne said, to determine if the industry minister will approve it.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/commodities/texas-california-widen-clean-power-lead-over-rest-us-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/SYY2YLXSBRNKNMS6MS64UO3XDA.jpg?auth=fd0b48ec7a834c46e1d797f0a639a4f254899a67965705e42d9f68d8f7764262&width=6500&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Texas and California widen clean power lead over rest of US\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"Texas and California are driving U.S. clean power supplies to record highs so far in 2025, and are building a widening lead over the rest of the country in terms of the share of total power generated from clean energy sources. Combined clean power output from the main power systems in California and Texas hit new highs during January to August and increased by 10% from the same months in 2024, data from LSEG shows. That clean output growth sharply exceeded the 2.6% rise in clean generation in the rest of the U.S., and helped total combined power generation levels in California and Texas expand by nearly twice as much as total power supplies elsewhere. Texas and California also lead the U.S. in new combined installations of solar and battery storage capacity so far in 2025, which looks set to further concentrate clean energy supply growth in those states. With federal support for building new clean energy generation capacity set to drop sharply, other states may now fall further behind Texas and California in terms of both clean and total power generation momentum. This could yield lopsided national power growth, with states that have already built out hefty clean capacity footprints outpacing states that have been slower to adopt clean generation capacity in recent years. Close to 74% of the wholesale power supplies generated within the California Independent System Operator (CAISO) came from clean sources during January to August, according to data from LSEG. That was by far the highest clean generation share on record for California, and compares to a 68% clean share for the same months last year and a 60% share for that period in 2023. The Electric Reliability Council of Texas (ERCOT) - which covers most of Texas - generated 46.5% of its power from clean sources during January to August. That share was also a record and is up from 43% last year and a 41% share in 2023. The total volume of clean power generated by CAISO during January to August increased by 4% from the same months in 2024 to a record 3.8 million megawatt hours (MWh), LSEG data shows. ERCOT's clean generation during January to August was 6.4 million MWh, which was 14% more than the same months the year before and also a new high. The combined clean generation total from those two states was 10.2 million MWh, which marked a 10% rise from the year before. Clean power generation in the rest of the U.S. during January to August was 39.9 million MWh, which was a also a record but marked only a 2.6% increase from the same months in 2024. As California and Texas expanded clean power generation more quickly than the rest of the country, their combined share of total national clean power generation climbed to a new high of 20.4% so far in 2025. That share compares to a 19.3% for January to August in 2024, and to a 19% share during January to August of 2023.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/commodities/aluminiums-years-plenty-are-drawing-close-2025-09-18/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/https%3A%2F%2Fauthor-service-images-prod-us-east-1.publishing.aws.arc.pub%2Freuters%2F041d84e1-f435-4784-90d1-978b227bc8c1.jpg?auth=2583d3f5f0516f20ce2a931d40d025531665051264e0953c7d0b5a92f6c1b6c7&height=240&width=240&quality=80&smart=true\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Aluminium's years of plenty are drawing to a close\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"LONDON, Sept 18 (Reuters) - The global aluminium market has been in structural supply surplus for so long that it's hard to imagine a genuine shortage of the light metal. Sure, there have been periodic squeezes on the London Metal Exchange (LME) contract over the years and another one is roiling the market right now. But these have been clashes between traders and banks tussling over control of LME inventory. The stocks financing trade, and its multiple warehousing spin-offs, is predicated on there being lots of surplus metal to play with. That, however, may be changing. Indeed, if you believe Citi, this is a market that is \\\"sleepwalking into the biggest deficits in 20 years\\\". It's a punchy call, as is the bank's expectation that the price will have to rise from its current level around $2,700 per metric ton to over $3,000 and stay there to stop the world running out of metal. So how come a market defined by historical excess is now facing imminent shortfall? The answer lies in China. China's production of primary aluminium has grown from four million tons in 2002 to 43 million tons in 2024. The country now accounts for 60% of global output. China has also become the world's largest aluminium consumer over the same time-frame but persistent over-production has spilled out in the form of semi-manufactured products. Exports last year hit a new record of 6.7 million tons. China, however, is fast approaching peak aluminium thanks to the government's mandated capacity cap of 45 million tons per year. August output was equivalent to 44.5 million tons, according to consultancy AZ Global. Some further output flex is possible if operators increase smelter amperage. But with Beijing showing no sign of adjusting the cap, the country's seemingly relentless production growth is shuddering to a halt. China's aluminium trade patterns are adjusting to the new reality. Exports of products such as rod, tube and foil fell by 9% year-on-year in the first seven months of the year. Imports of primary metal, on the other hand, rose by 11% to 1.5 million tons on the back of a near doubling in shipments from Russia. Sanctions on Russian aluminium mean the metal can't be delivered to the LME if it was produced after April 2024, which is why so much is now going to meet China's import demand. The diversion of what was once one of the exchange's main sources of physical liquidity has contributed to falling exchange stocks. What's noticeable, though, is the absence of any significant new inflow from other sources even though the market has been in the grip of a dominant long position since May. The warranting of 156,000 tons of aluminium between the end of June and the middle of August flattered to deceive. Just about all the metal that \\\"arrived\\\" was drawn down from off-warrant stocks in the LME system. Total LME aluminium stocks, registered and off-warrant, have held steady just above the 700,000-ton mark since May. There were over a million tons this time last year. Four years ago there were over three million tons. The stocks games are continuing, judging by the cancellation of almost 100,000 tons earlier this month, but the exchange liquidity pool is much smaller than it once was. It is the combination of stalled production growth in the world's largest supplier and low exchange inventory that has got analysts such as Citi reassessing aluminium's outlook over the coming years. Outside of China, primary aluminium production has been in long-term decline, not least due to China's massive exports, long a bone of contention with Western governments. True, U.S. President Donald Trump's decision to hike U.S. import tariffs to 50% may encourage some limited restarts of smelter capacity in the United States. But elsewhere others are struggling to stay afloat in the face of high energy costs. South32 warned last month that it may close its smelter in Mozambique if it can't secure a viable power contract by the end of next year. New primary supply hopes rest almost exclusively on Indonesia, where Chinese companies are investing in new smelters in a collective off-shoring from capacity-capped China. On paper the project pipeline could deliver seven million tons of new capacity over the second half of this decade. In reality, that's highly unlikely. New aluminium smelters will either have to compete with other sectors for energy supplies or build their own captive power plants. Current pricing makes the latter challenging, according to Citi, which expects Indonesian capacity to reach only 2.3 million tons per year by 2030. That may not be enough to keep up with global demand growth, which is getting a booster from aluminium's usage in energy transition sectors such as solar and electric vehicles. Hence Citi's call for a structural shift to higher pricing over a five-year horizon. The concept of a deficit market is a novelty for the aluminium market. Past crises have been caused by too much rather than too little metal. Back in the 1990s it was the flood of aluminium that poured through the broken Iron Curtain after the collapse of the Soviet Union. This century it's been China's massive over-production that has led to low prices and a string of smelter casualties in the rest of the world. The next aluminium crisis, though, is shaping up to be altogether different. The opinions expressed here are those of the author, a columnist for Reuters. Editing by Louise Heavens\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/us/heightened-uncertainties-feed-fed-inconsistencies-2025-09-18/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/https%3A%2F%2Fauthor-service-images-prod-us-east-1.publishing.aws.arc.pub%2Freuters%2Fda9db4d7-d9af-42a0-8b20-6dfd0db5f02a.jpg?auth=3ff4d1a760a4e1cde832bc1145a540e110bb736ef5d26af6268cab080656e2ad&height=240&width=240&quality=80&smart=true\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Heightened uncertainties feed Fed inconsistencies Jamie McGeever\",\n  \"date\": \"September 18, 2025\",\n  \"main_text\": \"ORLANDO, Florida, Sept 18 (Reuters) - The Federal Reserve cut interest rates on Wednesday for the first time in nine months, arguing the move is necessary to counter increasing risks to the labor market. The rationale is sound enough. There's only one problem - it seems to clash with many of the U.S. central bank's revised economic projections. In his press conference following a two-day policy meeting, Fed Chair Jerome Powell stressed that employment risks have risen substantially in recent months and now outweigh inflation risks. However, policymakers lowered their median 2026 and 2027 unemployment rate projections by a tenth of a percentage point to 4.4% and 4.3%, respectively, from three months ago. The revised \\\"dot plot\\\" chart of rate projections also showed that Fed officials now expect three quarter-percentage-point cuts this year, up from the two projected in June. But at the same time, officials lifted their median GDP growth projections for this year and next, while also raising next year's inflation outlook. So, to recap, the Fed is cutting rates and expects to front-load that easing, due to what Powell says are \\\"meaningful\\\" downside risks to the labor market. Yet officials are also penciling in lower unemployment rates than they were three months ago and higher growth and inflation rates. It's a confusing picture. 'MEETING-BY-MEETING SITUATION' But this confusion may be the biggest takeaway. Visibility surrounding the U.S. growth, inflation and employment outlooks is incredibly low, as Powell acknowledged, and the range of policymakers' forecasts has widened. \\\"From the dot plot to the economic forecasts, there are multiple inconsistencies that raise eyebrows,\\\" notes Ron Temple, chief market strategist at Lazard. \\\"The key message ... is that there is not a shared outlook among the FOMC (Federal Open Market Committee) participants.\\\" These inconsistencies may have been exacerbated by the addition of Stephen Miran, the head of President Donald Trump's Council of Economic Advisers, to the Fed's Board of Governors. His was the lone dissenting voice, calling for a 50-basis-point cut, and he also appears to have tipped the scale in favor of projections of more short-term easing. At the same time, few officials – perhaps with the exception of Miran – seem to hold these views with any real conviction. \\\"We're in a meeting-by-meeting situation,\\\" Powell told reporters, an indication that guidance offered by the dot plot is pretty loose. So it's unclear how committed the Fed even is to this new policy shift out of restrictive territory into a more neutral place. (To be fair to Powell and his colleagues, it is increasingly difficult to interpret the incoming data. The economic models and playbooks of yesteryear often no longer seem relevant to today's economy, as has been proven time and again this year. Just look at the unemployment rate. Labor market supply and demand are in broad balance, which is why the unemployment rate remains so low at 4.3%. But that's only because the alarming slump in hiring has been offset by the Trump administration's immigration policies and deportations, which are crushing labor supply. The \\\"breakeven\\\" rate of monthly payrolls growth needed to keep the unemployment rate steady is perhaps around 50,000 now, or even lower, down from around 150,000 earlier this year. The economy only added 22,000 jobs in August. So it's a \\\"curious balance\\\", according to Powell. And perhaps a dangerously unstable one. If companies' low hiring turns to outright firing, the unemployment rate could shoot higher, even if labor supply remains tight.) Visibility on the inflation side isn't much better. Policymakers' assessment that import tariffs will deliver a one-off price hit with no lasting inflationary effects is based more on hope than expectation. U.S. tariffs are the highest in a century, so this is new territory for policymakers today, and uncertainty surrounding the effect on consumer prices remains substantial. As a result, there is little clarity on either side of the Fed's mandate. The central bank is nevertheless choosing to put aside inflation fears and focus more on the upside risks to unemployment. Is there justification for this approach? Certainly. But is it the right move? Who knows. \\\"Tensions within the Fed's dual mandate of price stability and maximum sustainable employment are at the heart of several inconsistencies inside the Fed's rate, growth, inflation and unemployment forecasts,\\\" says Joe Brusuelas, chief economist at RSM. As Powell himself said, this is a \\\"particularly challenging time\\\" for the Fed, as \\\"there are no risk-free paths now\\\" for policymakers. The same can be said for investors.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/companies/AMD.O/\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Advanced Micro Devices Inc\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"Advanced Micro Devices Inc (AMD.O) is trading lower at 157.39 USD, a change of -0.53 USD or -0.34% as of September 20, 2025. Values are delayed up to 15 minutes. Today's range was between 155.90 and 159.84 USD, with a 52-week range of 76.48 to 186.65 USD.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/companies/AVGO.O/\",\n  \"image_url\": \"https://api.markitondemand.com/apiman-gateway/MOD/chartworks-image/1/Chart/price?inputs=%7B%22symbol%22%3A%22AMD.O%22%2C%22chartType%22%3A%22area%22%2C%22priceLineColor%22%3A%22%23dc4300%22%2C%22priceFillColor%22%3A%22%23fef3eb%22%2C%22priceLineWidth%22%3A1%2C%22xGridLineColor%22%3A%22%23E8E8E8%22%2C%22yGridLineColor%22%3A%22%23E8E8E8%22%2C%22realTime%22%3Afalse%2C%22numDays%22%3A365%2C%22width%22%3A138%2C%22height%22%3A75%2C%22fontSize%22%3A0%7D&access_token=qognDKLs8AkfEBioc32gQ3bb1Im4\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Broadcom Inc\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"Broadcom Inc. is a global technology firm that designs, develops, and supplies a range of semiconductors, enterprise software and security solutions. The Company operates through two segments: semiconductor solutions and infrastructure software. Its semiconductor solutions segment includes all of its product lines and intellectual property (IP) licensing. It provides a variety of radio frequency semiconductor devices, wireless connectivity solutions, custom touch controllers, and inductive charging solutions for mobile applications. Its infrastructure software segment includes its private and hybrid cloud, application development and delivery, software-defined edge, application networking and security, mainframe, distributed and cybersecurity solutions, and its FC SAN business. It provides a portfolio of software solutions that enable customers to plan, develop, automate, manage and secure applications across mainframe, distributed, mobile and cloud platforms.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://api.markitondemand.com/apiman-gateway/MOD/chartworks-image/1/Chart/price?inputs=%7B%22symbol%22%3A%22AVGO.O%22%2C%22chartType%22%3A%22area%22%2C%22priceLineColor%22%3A%22%23dc4300%22%2C%22priceFillColor%22%3A%22%23fef3eb%22%2C%22priceLineWidth%22%3A1%2C%22xGridLineColor%22%3A%22%23E8E8E8%22%2C%22yGridLineColor%22%3A%22%23E8E8E8%22%2C%22realTime%22%3Afalse%2C%22numDays%22%3A365%2C%22width%22%3A138%2C%22height%22%3A75%2C%22fontSize%22%3A0%7D&access_token=qognDKLs8AkfEBioc32gQ3bb1Im4\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market Talk: How Trump wants to shape the Fed and corporate America\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cdce91e4b01235ddea14e1?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market expert favors midcaps, wary of healthcare stocks\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cdc1e7e4b01235ddea14df-1758315006351?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Why Apple is the 'Treasury bill' of tech stocks\",\n  \"main_text\": \"Markets Now September 20, 2025 · 12:55 AM GMT+2 Wall St closes higher with indexes notching weekly gains Wall Street's main indexes closed higher on Friday and also posted a weekly gain, as FedEx rose after positive earnings. Lisa Bernhard has more.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cdb805e4b01235ddea14d9?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market Talk: Markets 'expect more rate cuts than Chair Powell'\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cd35eee4b01235ddea12bf?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market Rundown: Trump-Xi showdown call keeps traders on hold\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/business/finance/wall-st-week-ahead-us-housing-shares-shine-fed-restarts-rate-cuts-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/DQB5ISARN5JMTHE4COZYQLRHOI.jpg?auth=845f25831342aba44beccd1b78b5a878f734c7e8d03745f994ee286e88ac0e07&width=1080&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Wall St Week Ahead: US housing shares shine as Fed restarts rate cuts\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"NEW YORK, Sept 19 (Reuters) - As the U.S. Federal Reserve restarts interest rate cuts, housing shares are one of the areas of the stock market that may benefit, and they have perked up in recent weeks as markets priced in more monetary easing. On Wednesday, the U.S. central bank lowered its benchmark rate for the first time since December and indicated more cuts would follow as it tries to shore up a shaky labor market. The Fed's move stands to help interest-rate sensitive areas such as small-cap and consumer discretionary shares. Homebuilder stocks could also benefit if monetary easing translates into lower mortgage rates and more robust economic activity that helps the struggling housing sector, investors said. \\\"The Fed is rebooting the easing cycle,\\\" said Angelo Kourkafas, senior global investment strategist at Edward Jones. \\\"If we think about areas that may stand to benefit from that... homebuilders is one of them.\\\" The S&P 500 ended on Friday at record high levels, up over 13% on the year, after the Fed cut its benchmark rate by a quarter of a percentage point to the 4-4.25% range. On Thursday, the small-cap Russell 2000 posted a record-high close for the first time in nearly four years. Some investors hope the restart of monetary easing will boost economically sensitive stocks, broadening market leadership beyond the megacap technology companies that have driven indexes higher. The PHLX Housing index has jumped 15% so far this quarter, against an over 7% gain for the S&P 500, although the housing gauge still trails the benchmark stock market index on a year-to-date basis. Big gainers this quarter include DR Horton, up over 30%, and KB Home and Toll Brothers, both up over 20%. Home improvement retailers Lowe's and Home Depot are up about 20% and 13% so far in the quarter. The Mortgage Bankers Association said this week that the contract rate on a 30-year, fixed-rate mortgage fell to 6.39% in the week ended September 12, the lowest since early October 2024, while analysts at Keefe, Bruyette & Woods projected that the mortgage rates could approach 6% by year-end. The Fed's move to lower interest rates comes amid signs of struggle in the housing market. U.S. single-family homebuilding plunged to a near 2-1/2-year low in August, data on Wednesday showed. Fed Chair Jerome Powell described housing sector activity as \\\"weak\\\" in a press conference after the central bank's policy decision. \\\"If you can get some of those mortgage rates to come down, maybe that breathes a little bit of life back into the housing market,\\\" said Jack Janasiewicz, lead portfolio strategist at Natixis Investment Managers Solutions, adding that getting mortgage rates down in the 5% range was an important threshold. Investors cautioned that a lower Fed funds rate may not reduce mortgage rates by the same extent, because mortgage rates are more tied to the 10-year U.S. Treasury yield, which is influenced by broader factors. The 10-year Treasury yield was last around 4.13%, down from 4.6% in May. The extent of Fed rate reductions this year remains unclear, as persistently firm inflation could prompt the central bank to keep rates higher. Data in the coming week will shed more light on the housing market, including on existing and new home sales. \\\"A good housing turnover is generally good for economic activity,\\\" said Paul Nolte, senior wealth adviser and market strategist at Murphy & Sylvest Wealth Management. \\\"So we'd like to see those numbers rising consistently.\\\" Economic data next week includes an updated read of second-quarter gross domestic product, manufacturing and services sector reports, and the personal consumption expenditures price index, a closely watched inflation gauge, while investors will also be watching remarks from Powell on Tuesday. With the central bank noting it is not on a preset path and a disparity among Fed members about the expected trajectory of rates, \\\"this likely means there will be volatility around forthcoming economic data — especially data on the labor market and inflation,\\\" Seth Basham, director of equity research at Wedbush, said in a note.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/world/americas/argentinas-central-bank-makes-biggest-daily-dollar-sale-six-years-curb-peso-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/DQB5ISARN5JMTHE4COZYQLRHOI.jpg?auth=845f25831342aba44beccd1b78b5a878f734c7e8d03745f994ee286e88ac0e07&width=120&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Argentina's central bank makes biggest daily dollar sale in six years to curb peso slide\",\n  \"main_text\": \"BUENOS AIRES, Sept 19 (Reuters) - Argentina's central bank on Friday made its largest daily dollar sale in nearly six years as it continued to use reserves to support the local currency, meeting strong dollar demand from institutional investors wary of political instability. The bank's latest intervention totaled $678 million, its largest for a single day since October 2019, bringing the amount sold in the last three sessions to $1.1 billion. The bank has been seeking to manage liquidity at the top of its floating exchange-rate band, and Argentina's economy chief vowed to keep using the monetary authority's reserves as the local peso hovers at historic lows. \\\"We're going to sell every last dollar (of the central bank's reserves) at the top of the band,\\\" Economy Minister Luis Caputo said on Thursday night during a livestreamed interview. The deteriorating market backdrop underscores deepening investor skepticism ahead of pivotal midterm elections in October that could strip libertarian President Javier Milei of crucial congressional support for his reform agenda. On Friday, the wholesale peso settled stable at 1,475 per dollar after the central bank's moves, near the band's ceiling. In the informal \\\"blue\\\" market, however, the Argentine currency slipped to an all-time low of 1,520 per greenback, weakening more than 6% in the week. The central bank had not made an intervention since mid-April, after a $20 billion International Monetary Fund deal that initially loosened foreign-exchange curbs. \\\"Given that this pace of dollar sales by the central bank would imply a loss of reserves of approximately $10 billion before the elections - approximately 70% of the funds already disbursed by the IMF - the likelihood of abandoning the exchange-rate band scheme before the October 26 elections increases,\\\" BancTrust & Co said. While the central bank's international reserves stand at $39.26 billion, analysts say provisional official data indicates that net foreign exchange reserves for intervention are estimated at just $6 billion. Continued dollar sales, experts warn, risk accelerating reserve depletion, jeopardizing near-term debt payments and triggering a rise in bond issuance to bridge funding gaps. Caputo affirmed the current exchange rate framework and said the Treasury is working to ensure January debt payments, promising to provide clarity to bondholders once finalized. Argentina's country risk - a measure of investor confidence - reached its highest level since August 2024, hovering around 1,500 basis points, while over-the-counter bonds fell 1.4% on average. They were down 9.2% in the week. Buenos Aires' main stock index closed down 0.7% on Friday. Argentines vote in October to renew part of the lower house and Senate, amid uncertainty over how the government will recover from setbacks in Buenos Aires province in recent contests.\",\n  \"date\": \"September 19, 2025\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/business/tax-firm-andersen-reveals-over-12-revenue-surge-us-ipo-filing-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/TZOKCGN7YBOZHK3U723IBBT674.jpg?auth=16a7acfca91709cf948469925462ca2f4abc22fbe2f21782b2ca80f70a32d825&width=120&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Tax firm Andersen reveals over 12% revenue jump in US IPO filing\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"Sept 19 (Reuters) - Andersen Group reported a 12.4% rise in revenue for the first half of 2025, the professional services firm disclosed on Friday in its U.S. initial public offering filing, setting the stage for a rare listing by a consulting firm. New listings have gained traction as buoyant equity markets and robust corporate earnings help investors navigate a persistently uncertain macroeconomic environment. Crypto custody startup BitGo and corporate travel and expense management firm Navan also filed IPO paperwork on Friday, seeking to go public in New York. Andersen, which confidentially filed for a New York IPO in April, traces its origins to Wealth & Tax Advisory Services, founded in 2002 by 23 former Arthur Andersen partners. Arthur Andersen, once a member of the Big Five accounting firms, collapsed in the aftermath of the Enron scandal, leaving Deloitte, PwC, EY and KPMG as the surviving Big Four. A potential listing by the company would mark a notable emergence from the legacy of Arthur Andersen, positioning it as one of the few publicly traded tax and consulting firms in the United States. \\\"The profile of U.S. IPOs has broadened significantly over the past weeks with strong investor demand for respective deals across sectors,\\\" said Kat Liu, vice president at IPO research firm IPOX. The San Francisco-based company, which rebranded as Andersen in 2014 after acquiring the rights to the name, offers tax, valuation, financial advisory, and related consulting services to individual and commercial clients. The company swung to a loss of $45.4 million on revenue of $384.1 million for the six months ended June 30, compared to a profit of $46.9 million on revenue of $341.6 million in the same period a year earlier. Morgan Stanley and UBS are serving as lead underwriters for the offering. Andersen plans to list on the New York Stock Exchange under the ticker symbol \\\"ANDG\\\".\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/business/take-five/global-markets-themes-graphic-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/ZTAPRYUTDBJJ5A7TUPMARZGSRM.jpg?auth=b5238b9c4a91e0b2b9ffdebbad613a8bc3ec33e6236bd6f94e33b5be96f5d44f&width=120&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Take Five: Chop, chop!\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"LONDON, Sept 19 (Reuters) - It's back to scouring data for signs of how quickly, if at all, further rate cuts could come from big economies, Switzerland's central bank meets and world leaders gather in New York for the UN general assembly against a tense geopolitical backdrop. Here's all you need to know about the week ahead in global markets from Lewis Krauskopf in New York, Rae Wee in Singapore and Amanda Cooper, Sara Rossi and Karin Strohecker in London. The U.S. Federal Reserve has just cut rates for the first time since December and indicated more is to come. That's the backdrop to the slew of U.S. data out in coming days including housing, durable goods, consumer sentiment and inflation. Monthly reports on new and existing home sales are due as investors weigh whether the prospect of a series of rate cuts can lift the housing market. An updated look at Q2 gross domestic product will paint more of a picture about growth, before the week closes on Friday with a consumer sentiment survey and the personal consumption expenditures price index, a closely watched inflation gauge. As focus shifts to the economic outlook over inflation, any weaker-than-expected numbers could further hurt the dollar - it touched its lowest level since 2022 on Wednesday. The Swiss National Bank meets on Thursday and traders expect no change to the benchmark rate, currently at 0%. SNB officials have indicated the bar is high for a drop into negative territory, even in light of the headache caused by a strong Swiss franc. It has rallied by around 15% against the dollar year-to-date and is set for its largest annual gain since 2002. In Europe, Tuesday's preliminary estimates for the September euro zone PMI could show further improvement in the manufacturing sector and a stabilisation in expansionary territory for services. Britain's flash PMI, also out Tuesday, follows the latest BoE decision to leave rates steady. Australia's August consumer price reading on Wednesday comes ahead of the September 30 Reserve Bank of Australia policy meeting, where officials are widely expected to stand pat on rates. Investors and policymakers will be hoping that latest inflation figures show some signs of easing. World leaders are meeting in New York for the United Nations General Assembly at a fraught time for global politics. Trump will speak on Tuesday, while Israeli Prime Minister Benjamin Netanyahu is due to address the assembly on Friday.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/business/us-equity-funds-see-large-outflows-investors-book-profit-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/FUBTGATC45MSXCEDX2I2CX4ZVQ.jpg?auth=cba10a311c21f91601923c24eeddcddfa84783f286a866aec0afce19d913818a&width=3539&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"U.S. equity funds see large outflows as investors book profit\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"Sept 19 (Reuters) - Investors withdrew massive capital out of U.S. equity funds in the week to Sept. 17 as they turned cautious about the market's lofty valuations following the recent rally through a policy rate cut by the Federal Reserve and rushed to lock in profits. According to LSEG Lipper data, investors pulled out a net $43.19 billion from U.S. equity funds in the week, logging their largest weekly net sales since a $50.62 billion weekly outflow in mid-December 2024. The S&P 500 hit a record high of 6,656.8 on Thursday, close to a 37.7% gain from nearly a 1-1/2 year low of 4,835.04 hit of April 7. \\\"The S&P 500 forward price-to-earnings ratio, at 22.6x, is in the 99th percentile over the past 20 years,\\\" said Mark Haefele, Chief Investment Officer at UBS Global Wealth Management. \\\"After such a strong recent run, a period of consolidation should not come as a surprise, in our view,\\\" UBS's Haefele said. U.S. large-cap funds had a net $34.19 billion weekly outflow, the biggest since at least 2020. Investors also shed mid-cap funds of $1.58 billion but invested a marginal $50 million in small-cap funds. Sectoral funds saw a net $1.24 billion outflow, the first weekly net sales in four weeks as investors dumped technology sector funds of a robust $2.84 billion. U.S. bond funds, meanwhile, saw a 22nd successive weekly inflow to the tune of $7.33 billion. The short-to-intermediate investment-grade funds, general domestic taxable fixed income funds and municipal debt funds stood out with $1.59 billion, $1.14 billion and $1.04 billion, respectively in weekly inflows. Investors, meanwhile, ditched $23.65 billion worth of money market funds, bringing a three-week trend of net purchases to an end. Reporting by Gaurav Dogra; Editing by Nick Zieminski.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/world/americas/canada-will-take-close-look-teck-anglo-deal-finance-minister-says-2025-09-20/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/DWNXCMIMT5KOPO7Q4RXJV6UWGQ.jpg?auth=0b9c06335f047599b572b4b0531a2eef20b6bfb9924e10f022f35c52c72baa21&width=1080&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Canada will take a close look at the Teck-Anglo deal, finance minister says\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"TORONTO, Sept 20 (Reuters) - The proposed $53 billion merger between Teck Resources and Anglo American is under review by Canada's federal government, which must make sure it is in the net benefit of the country, Finance Minister Francois Philippe Champagne said on Saturday. \\\"Canada will take a close look at the Teck-Anglo deal,\\\" Champagne said, to determine if the industry minister will approve it.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/commodities/texas-california-widen-clean-power-lead-over-rest-us-2025-09-19/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/SYY2YLXSBRNKNMS6MS64UO3XDA.jpg?auth=fd0b48ec7a834c46e1d797f0a639a4f254899a67965705e42d9f68d8f7764262&width=6500&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Texas and California widen clean power lead over rest of US\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"Texas and California are driving U.S. clean power supplies to record highs so far in 2025, and are building a widening lead over the rest of the country in terms of the share of total power generated from clean energy sources. Combined clean power output from the main power systems in California and Texas hit new highs during January to August and increased by 10% from the same months in 2024, data from LSEG shows. That clean output growth sharply exceeded the 2.6% rise in clean generation in the rest of the U.S., and helped total combined power generation levels in California and Texas expand by nearly twice as much as total power supplies elsewhere. Texas and California also lead the U.S. in new combined installations of solar and battery storage capacity so far in 2025, which looks set to further concentrate clean energy supply growth in those states. With federal support for building new clean energy generation capacity set to drop sharply, other states may now fall further behind Texas and California in terms of both clean and total power generation momentum. This could yield lopsided national power growth, with states that have already built out hefty clean capacity footprints outpacing states that have been slower to adopt clean generation capacity in recent years. Close to 74% of the wholesale power supplies generated within the California Independent System Operator (CAISO) came from clean sources during January to August, according to data from LSEG. That was by far the highest clean generation share on record for California, and compares to a 68% clean share for the same months last year and a 60% share for that period in 2023. The Electric Reliability Council of Texas (ERCOT) - which covers most of Texas - generated 46.5% of its power from clean sources during January to August. That share was also a record and is up from 43% last year and a 41% share in 2023. The total volume of clean power generated by CAISO during January to August increased by 4% from the same months in 2024 to a record 3.8 million megawatt hours (MWh), LSEG data shows. ERCOT's clean generation during January to August was 6.4 million MWh, which was 14% more than the same months the year before and also a new high. The combined clean generation total from those two states was 10.2 million MWh, which marked a 10% rise from the year before. Clean power generation in the rest of the U.S. during January to August was 39.9 million MWh, which was a also a record but marked only a 2.6% increase from the same months in 2024. As California and Texas expanded clean power generation more quickly than the rest of the country, their combined share of total national clean power generation climbed to a new high of 20.4% so far in 2025. That share compares to a 19.3% for January to August in 2024, and to a 19% share during January to August of 2023.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/commodities/aluminiums-years-plenty-are-drawing-close-2025-09-18/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/https%3A%2F%2Fauthor-service-images-prod-us-east-1.publishing.aws.arc.pub%2Freuters%2F041d84e1-f435-4784-90d1-978b227bc8c1.jpg?auth=2583d3f5f0516f20ce2a931d40d025531665051264e0953c7d0b5a92f6c1b6c7&height=240&width=240&quality=80&smart=true\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Aluminium's years of plenty are drawing to a close\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"LONDON, Sept 18 (Reuters) - The global aluminium market has been in structural supply surplus for so long that it's hard to imagine a genuine shortage of the light metal. Sure, there have been periodic squeezes on the London Metal Exchange (LME) contract over the years and another one is roiling the market right now. But these have been clashes between traders and banks tussling over control of LME inventory. The stocks financing trade, and its multiple warehousing spin-offs, is predicated on there being lots of surplus metal to play with. That, however, may be changing. Indeed, if you believe Citi, this is a market that is \\\"sleepwalking into the biggest deficits in 20 years\\\". It's a punchy call, as is the bank's expectation that the price will have to rise from its current level around $2,700 per metric ton to over $3,000 and stay there to stop the world running out of metal. So how come a market defined by historical excess is now facing imminent shortfall? The answer lies in China. China's production of primary aluminium has grown from four million tons in 2002 to 43 million tons in 2024. The country now accounts for 60% of global output. China has also become the world's largest aluminium consumer over the same time-frame but persistent over-production has spilled out in the form of semi-manufactured products. Exports last year hit a new record of 6.7 million tons. China, however, is fast approaching peak aluminium thanks to the government's mandated capacity cap of 45 million tons per year. August output was equivalent to 44.5 million tons, according to consultancy AZ Global. Some further output flex is possible if operators increase smelter amperage. But with Beijing showing no sign of adjusting the cap, the country's seemingly relentless production growth is shuddering to a halt. China's aluminium trade patterns are adjusting to the new reality. Exports of products such as rod, tube and foil fell by 9% year-on-year in the first seven months of the year. Imports of primary metal, on the other hand, rose by 11% to 1.5 million tons on the back of a near doubling in shipments from Russia. Sanctions on Russian aluminium mean the metal can't be delivered to the LME if it was produced after April 2024, which is why so much is now going to meet China's import demand. The diversion of what was once one of the exchange's main sources of physical liquidity has contributed to falling exchange stocks. What's noticeable, though, is the absence of any significant new inflow from other sources even though the market has been in the grip of a dominant long position since May. The warranting of 156,000 tons of aluminium between the end of June and the middle of August flattered to deceive. Just about all the metal that \\\"arrived\\\" was drawn down from off-warrant stocks in the LME system. Total LME aluminium stocks, registered and off-warrant, have held steady just above the 700,000-ton mark since May. There were over a million tons this time last year. Four years ago there were over three million tons. The stocks games are continuing, judging by the cancellation of almost 100,000 tons earlier this month, but the exchange liquidity pool is much smaller than it once was. It is the combination of stalled production growth in the world's largest supplier and low exchange inventory that has got analysts such as Citi reassessing aluminium's outlook over the coming years. Outside of China, primary aluminium production has been in long-term decline, not least due to China's massive exports, long a bone of contention with Western governments. True, U.S. President Donald Trump's decision to hike U.S. import tariffs to 50% may encourage some limited restarts of smelter capacity in the United States. But elsewhere others are struggling to stay afloat in the face of high energy costs. South32 warned last month that it may close its smelter in Mozambique if it can't secure a viable power contract by the end of next year. New primary supply hopes rest almost exclusively on Indonesia, where Chinese companies are investing in new smelters in a collective off-shoring from capacity-capped China. On paper the project pipeline could deliver seven million tons of new capacity over the second half of this decade. In reality, that's highly unlikely. New aluminium smelters will either have to compete with other sectors for energy supplies or build their own captive power plants. Current pricing makes the latter challenging, according to Citi, which expects Indonesian capacity to reach only 2.3 million tons per year by 2030. That may not be enough to keep up with global demand growth, which is getting a booster from aluminium's usage in energy transition sectors such as solar and electric vehicles. Hence Citi's call for a structural shift to higher pricing over a five-year horizon. The concept of a deficit market is a novelty for the aluminium market. Past crises have been caused by too much rather than too little metal. Back in the 1990s it was the flood of aluminium that poured through the broken Iron Curtain after the collapse of the Soviet Union. This century it's been China's massive over-production that has led to low prices and a string of smelter casualties in the rest of the world. The next aluminium crisis, though, is shaping up to be altogether different. The opinions expressed here are those of the author, a columnist for Reuters. Editing by Louise Heavens\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/us/heightened-uncertainties-feed-fed-inconsistencies-2025-09-18/\",\n  \"image_url\": \"https://www.reuters.com/resizer/v2/https%3A%2F%2Fauthor-service-images-prod-us-east-1.publishing.aws.arc.pub%2Freuters%2Fda9db4d7-d9af-42a0-8b20-6dfd0db5f02a.jpg?auth=3ff4d1a760a4e1cde832bc1145a540e110bb736ef5d26af6268cab080656e2ad&height=240&width=240&quality=80&smart=true\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Heightened uncertainties feed Fed inconsistencies Jamie McGeever\",\n  \"date\": \"September 18, 2025\",\n  \"main_text\": \"ORLANDO, Florida, Sept 18 (Reuters) - The Federal Reserve cut interest rates on Wednesday for the first time in nine months, arguing the move is necessary to counter increasing risks to the labor market. The rationale is sound enough. There's only one problem - it seems to clash with many of the U.S. central bank's revised economic projections. In his press conference following a two-day policy meeting, Fed Chair Jerome Powell stressed that employment risks have risen substantially in recent months and now outweigh inflation risks. However, policymakers lowered their median 2026 and 2027 unemployment rate projections by a tenth of a percentage point to 4.4% and 4.3%, respectively, from three months ago. The revised \\\"dot plot\\\" chart of rate projections also showed that Fed officials now expect three quarter-percentage-point cuts this year, up from the two projected in June. But at the same time, officials lifted their median GDP growth projections for this year and next, while also raising next year's inflation outlook. So, to recap, the Fed is cutting rates and expects to front-load that easing, due to what Powell says are \\\"meaningful\\\" downside risks to the labor market. Yet officials are also penciling in lower unemployment rates than they were three months ago and higher growth and inflation rates. It's a confusing picture. 'MEETING-BY-MEETING SITUATION' But this confusion may be the biggest takeaway. Visibility surrounding the U.S. growth, inflation and employment outlooks is incredibly low, as Powell acknowledged, and the range of policymakers' forecasts has widened. \\\"From the dot plot to the economic forecasts, there are multiple inconsistencies that raise eyebrows,\\\" notes Ron Temple, chief market strategist at Lazard. \\\"The key message ... is that there is not a shared outlook among the FOMC (Federal Open Market Committee) participants.\\\" These inconsistencies may have been exacerbated by the addition of Stephen Miran, the head of President Donald Trump's Council of Economic Advisers, to the Fed's Board of Governors. His was the lone dissenting voice, calling for a 50-basis-point cut, and he also appears to have tipped the scale in favor of projections of more short-term easing. At the same time, few officials – perhaps with the exception of Miran – seem to hold these views with any real conviction. \\\"We're in a meeting-by-meeting situation,\\\" Powell told reporters, an indication that guidance offered by the dot plot is pretty loose. So it's unclear how committed the Fed even is to this new policy shift out of restrictive territory into a more neutral place. (To be fair to Powell and his colleagues, it is increasingly difficult to interpret the incoming data. The economic models and playbooks of yesteryear often no longer seem relevant to today's economy, as has been proven time and again this year. Just look at the unemployment rate. Labor market supply and demand are in broad balance, which is why the unemployment rate remains so low at 4.3%. But that's only because the alarming slump in hiring has been offset by the Trump administration's immigration policies and deportations, which are crushing labor supply. The \\\"breakeven\\\" rate of monthly payrolls growth needed to keep the unemployment rate steady is perhaps around 50,000 now, or even lower, down from around 150,000 earlier this year. The economy only added 22,000 jobs in August. So it's a \\\"curious balance\\\", according to Powell. And perhaps a dangerously unstable one. If companies' low hiring turns to outright firing, the unemployment rate could shoot higher, even if labor supply remains tight.) Visibility on the inflation side isn't much better. Policymakers' assessment that import tariffs will deliver a one-off price hit with no lasting inflationary effects is based more on hope than expectation. U.S. tariffs are the highest in a century, so this is new territory for policymakers today, and uncertainty surrounding the effect on consumer prices remains substantial. As a result, there is little clarity on either side of the Fed's mandate. The central bank is nevertheless choosing to put aside inflation fears and focus more on the upside risks to unemployment. Is there justification for this approach? Certainly. But is it the right move? Who knows. \\\"Tensions within the Fed's dual mandate of price stability and maximum sustainable employment are at the heart of several inconsistencies inside the Fed's rate, growth, inflation and unemployment forecasts,\\\" says Joe Brusuelas, chief economist at RSM. As Powell himself said, this is a \\\"particularly challenging time\\\" for the Fed, as \\\"there are no risk-free paths now\\\" for policymakers. The same can be said for investors.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/companies/AMD.O/\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Advanced Micro Devices Inc\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"Advanced Micro Devices Inc (AMD.O) is trading lower at 157.39 USD, a change of -0.53 USD or -0.34% as of September 20, 2025. Values are delayed up to 15 minutes. Today's range was between 155.90 and 159.84 USD, with a 52-week range of 76.48 to 186.65 USD.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/companies/AVGO.O/\",\n  \"image_url\": \"https://api.markitondemand.com/apiman-gateway/MOD/chartworks-image/1/Chart/price?inputs=%7B%22symbol%22%3A%22AMD.O%22%2C%22chartType%22%3A%22area%22%2C%22priceLineColor%22%3A%22%23dc4300%22%2C%22priceFillColor%22%3A%22%23fef3eb%22%2C%22priceLineWidth%22%3A1%2C%22xGridLineColor%22%3A%22%23E8E8E8%22%2C%22yGridLineColor%22%3A%22%23E8E8E8%22%2C%22realTime%22%3Afalse%2C%22numDays%22%3A365%2C%22width%22%3A138%2C%22height%22%3A75%2C%22fontSize%22%3A0%7D&access_token=qognDKLs8AkfEBioc32gQ3bb1Im4\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Broadcom Inc\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"Broadcom Inc. is a global technology firm that designs, develops, and supplies a range of semiconductors, enterprise software and security solutions. The Company operates through two segments: semiconductor solutions and infrastructure software. Its semiconductor solutions segment includes all of its product lines and intellectual property (IP) licensing. It provides a variety of radio frequency semiconductor devices, wireless connectivity solutions, custom touch controllers, and inductive charging solutions for mobile applications. Its infrastructure software segment includes its private and hybrid cloud, application development and delivery, software-defined edge, application networking and security, mainframe, distributed and cybersecurity solutions, and its FC SAN business. It provides a portfolio of software solutions that enable customers to plan, develop, automate, manage and secure applications across mainframe, distributed, mobile and cloud platforms.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://api.markitondemand.com/apiman-gateway/MOD/chartworks-image/1/Chart/price?inputs=%7B%22symbol%22%3A%22AVGO.O%22%2C%22chartType%22%3A%22area%22%2C%22priceLineColor%22%3A%22%23dc4300%22%2C%22priceFillColor%22%3A%22%23fef3eb%22%2C%22priceLineWidth%22%3A1%2C%22xGridLineColor%22%3A%22%23E8E8E8%22%2C%22yGridLineColor%22%3A%22%23E8E8E8%22%2C%22realTime%22%3Afalse%2C%22numDays%22%3A365%2C%22width%22%3A138%2C%22height%22%3A75%2C%22fontSize%22%3A0%7D&access_token=qognDKLs8AkfEBioc32gQ3bb1Im4\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market Talk: How Trump wants to shape the Fed and corporate America\",\n  \"date\": \"September 20, 2025\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cdce91e4b01235ddea14e1?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market expert favors midcaps, wary of healthcare stocks\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cdc1e7e4b01235ddea14df-1758315006351?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Why Apple is the 'Treasury bill' of tech stocks\",\n  \"main_text\": \"Markets Now September 20, 2025 · 12:55 AM GMT+2 Wall St closes higher with indexes notching weekly gains Wall Street's main indexes closed higher on Friday and also posted a weekly gain, as FedEx rose after positive earnings. Lisa Bernhard has more.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cdb805e4b01235ddea14d9?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market Talk: Markets 'expect more rate cuts than Chair Powell'\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}",
  "{\n  \"url\": \"https://www.reuters.com/markets/\",\n  \"image_url\": \"https://ajo.prod.reuters.tv/api/v2/img/68cd35eee4b01235ddea12bf?width=480&quality=80\",\n  \"provider\": \"Reuters\",\n  \"title\": \"Market Rundown: Trump-Xi showdown call keeps traders on hold\",\n  \"date\": \"September 19, 2025\",\n  \"main_text\": \"All three of Wall Street's main indexes registered record closing highs for a second straight day on Friday, with trading volume hitting its highest level since April, as FedEx rose after upbeat earnings.\"\n}"
]